## Plan Result (test_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
        name                              = "cft-apim00-perftest-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (7 unchanged attributes hidden)

      ~ rewrite_rule_set {
            id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule"
            name = "cft-mtls-api-mgmt-appgw-rewriterule"

          ~ rewrite_rule {
              ~ name          = "ClientCertAddCustomHeaderRule" -> "SdtAddCustomHeadersRule"
                # (1 unchanged attribute hidden)

              + url {
                  + reroute = false
                }

                # (3 unchanged blocks hidden)
            }
          + rewrite_rule {
              + name          = "SdtUrlRewriteRule"
              + rule_sequence = 200

              + condition {
                  + ignore_case = false
                  + negate      = false
                  + pattern     = ".*/producers(?>-comx)?/service/sdtapi"
                  + variable    = "{var_uri_path}"
                }

              + url {
                  + components = "path_only"
                  + path       = "/sdt-gateway"
                  + reroute    = false
                }
            }
        }

        # (25 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1765,"Program":"tfcmt","SHA1":"","Target":"test_apim_appgw","Vars":{}} -->